TDPortal/Utilities/EnhancedExposedServicesTestTool/ExposedServicesTestToolClient/Requests/JourneyPlannerSynchronous/V1/PlanPublicJourneyReturn.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
	 <PlanPublicJourney xmlns="http://www.transportdirect.info/TransportDirect.EnhancedExposedServices.JourneyPlannerSynchronous.V1">
      <transactionId>TestJPReturn</transactionId>
      <language>en-GB</language>
      <request>
        <IsReturnRequired>true</IsReturnRequired>
        <OutwardArriveBefore>false</OutwardArriveBefore>
        <ReturnArriveBefore>false</ReturnArriveBefore>
        <OutwardDateTime>2014-04-18T18:32:26.2939351-00:00</OutwardDateTime>
        <ReturnDateTime>2014-04-19T18:32:26.2939351-00:00</ReturnDateTime>
        <InterchangeSpeed>0</InterchangeSpeed>
        <WalkingSpeed>80</WalkingSpeed>
        <MaxWalkingTime>5</MaxWalkingTime>
        <OriginLocation>         
          <Type>Postcode</Type>
          <Postcode>W3 7JW</Postcode>
        </OriginLocation>
        <DestinationLocation>          
          <Type>Postcode</Type>
          <Postcode>EC1R 3HN</Postcode>
        </DestinationLocation>
        <Sequence>3</Sequence>
      </request>
    </PlanPublicJourney>
  </soap:Body>
</soap:Envelope>